const mongoose = require('mongoose');

const Category = require('./app/models/category');
const User = require('./app/models/user');
const Post = require('./app/models/post');
const Comment = require('./app/models/comment');

const db = require('./config/db');

// establish database connection
mongoose.Promise = global.Promise;
mongoose.connect(db, {
  useMongoClient: true
});

connection = mongoose.connection;

const categories = [
  "التعنيف",
  "فرط الحركة",
  "التبني",
  "الزهايمر",
  "مبتور اليد",
  "الغضب",
  "القلق",
  "التهاب المفاصل",
  "الربو",
  "التوحد",
  "التبول اللاإرادي",
  "شراهة الأكل",
  "العيوب الخلقية",
  "سرطان المثانة",
  "سرطان العظام",
  "انفصام الشخصية",
  "سرطان المخ",
  "سرطان الثدي",
  "التنمر",
  "الحروق",
  "الاضطرابات الهضمية",
  "اصابات الدماغ",
  "سرطان الرحم",
  "العلاج الكيميائي",
  "الألم المزمن",
  "التليف الكبدي",
  "التعلق العاطفي",
  "سرطان القولون",
  "الآباء",
  "الإحباط",
  "الإسهال",
  "مرض السكر",
  "الطلاق",
  "متلازمة داون",
  "اضطرابات الأكل",
  "الاكزيما",
  "التعنيف العاطفي",
  "الصرع",
  "العائلة",
  "حساسية الأكل",
  "العادة السرية",
  "الأصدقاء",
  "المقبلين على الزواج",
  "الحزن",
  "تساقط الشعر",
  "النباتيين",
  "الجلطات",
  "الهربس",
  "الايدز",
  "ارتفاع الكريسترول",
  "الغدة الدرقية",
  "استئصال الرحم",
  "العقم",
  "الخيانة",
  "القولون",
  "الغيرة",
  "سرطان الكلية",
  "صعوبات التعلم",
  "سرطان الكبد",
  "العزلة",
  "سرطان الرئة",
  "انقطاع الطمث",
  "الصداع النصفي",
  "الإجهاض",
  "الأمهات",
  "التصلب اللويحي",
  "الغذاء الصحي",
  "السمنة",
  "هشاشة العظام",
  "سرطان المبيض",
  "سرطان البنكرياس",
  "نوبة الهلع",
  "جنون العظمة",
  "اضطراب الشخصية",
  "الرهاب الاجتماعي",
  "الرهاب",
  "جراحة التجميل",
  "اكتئاب الولادة",
  "الحمل",
  "سرطان البروستاتا",
  "الصدفية",
  "التقاعد",
  "عرق النسا",
  "إدمان الشراء",
  "الآباء العزاب",
  "عناية الجلد",
  "سرطان الجلد",
  "المشي أثناء النوم",
  "التدخين",
  "الضغط",
  "التأتأة",
  "المراهقة",
  "تساقط الشعر",
  "العطالة",
  "الأرامل",
  "المطلقين"
  ];

categories.forEach((category, index) => {
  const newCategory = new Category({
    name: category
  });

  newCategory.save().then(category => {
    console.log(`Added ${category.name}`);
    connection.close();
  });
});
